In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("sample.csv")

In [4]:
data.head()

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
0,Abingdon,1006457,GB,GBP,174.0,1.0,0.468812
1,Alloa,1007295,GB,GBP,89.0,0.0,0.252819
2,Amersham,1006474,GB,GBP,45.0,0.0,0.126163
3,Annan,1007297,GB,GBP,58.0,0.0,0.144051
4,Baldock,1006493,GB,GBP,93.0,0.0,0.264777

In [5]:
#can use below or as data.Impressions, the output of this is boolean
data["Impressions"].head() > 5000

0    False
1    False
2    False
3    False
4    False
Name: Impressions, dtype: bool

In [6]:
#so to return all the filtered rows, it's as below
filter = data["Impressions"] > 10000

In [7]:
data[filter]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
501,Unknown,Unknown,GB,GBP,58965.0,102.0,155.147206
774,London,1006886,GB,GBP,29341.0,33.0,77.162183
844,NaN,NaN,NaN,NaN,275810.0,478.0,724.855704

In [8]:
data[data.Clicks == 102]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
501,Unknown,Unknown,GB,GBP,58965.0,102.0,155.147206

In [9]:
data[data.Clicks > 100]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
501,Unknown,Unknown,GB,GBP,58965.0,102.0,155.147206
844,NaN,NaN,NaN,NaN,275810.0,478.0,724.855704

In [11]:
#above created an error because python doesn't know how to return 1 true or false value
#so above we need to use & instead 
#with & it will return True only when both conditions are met
data[(data.Clicks > 200) & (data.Impressions > 10000)]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
844,NaN,NaN,NaN,NaN,275810.0,478.0,724.855704

In [12]:
#above there is error again, because condition 1 has mixed True and False signals
#condition 2 also has mixed True and False 
#so 'and' doesn't know how to work with this
#so we change it to & so it compares individual row's whether it has met first and second condition 
#as opposed to condition 1 as a whole 'and' condition 2 as a whole

#now below with brackets to make sure it's clearly defined
data[(data.Clicks > 100) & (data.Impressions > 10000)]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
501,Unknown,Unknown,GB,GBP,58965.0,102.0,155.147206
844,NaN,NaN,NaN,NaN,275810.0,478.0,724.855704

In [13]:
#here another example
data[(data.City == "Alloa") & (data.Impressions > 10000)]

Empty DataFrame
Columns: [City, City ID, Country, Advertiser Currency, Impressions, Clicks, Revenue (Adv Currency)]
Index: []

---

In [14]:
#below function returns the unique value 
data.Country.unique()

array(['GB', nan], dtype=object)

In [15]:
data.head()

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
0,Abingdon,1006457,GB,GBP,174.0,1.0,0.468812
1,Alloa,1007295,GB,GBP,89.0,0.0,0.252819
2,Amersham,1006474,GB,GBP,45.0,0.0,0.126163
3,Annan,1007297,GB,GBP,58.0,0.0,0.144051
4,Baldock,1006493,GB,GBP,93.0,0.0,0.264777

In [58]:
data = data.drop(data.index[844:])

In [35]:
#below we explore how to return data/rows with cells contains certain texts/string
data[data.City.str.contains("Alloa")]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
1,Alloa,1007295,GB,GBP,89.0,0.0,0.252819

In [37]:
#here if we weren't sure about the case of the test then we can use case=boolean on this
data[data.City.str.contains("alloa", case=False)]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
1,Alloa,1007295,GB,GBP,89.0,0.0,0.252819

In [41]:
#what if the string of text is long or you like multiple to be filled then we use & or |
data[(data.City.str.contains("all", case=False)) | (data.City.str.contains("oad", case=False))]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
1,Alloa,1007295,GB,GBP,89.0,0.0,0.252819
24,Broadbridge Heath,1006568,GB,GBP,1.0,0.0,0.002763
139,Wainfleet All Saints,1007187,GB,GBP,52.0,1.0,0.123673
140,Wallasey,1007189,GB,GBP,181.0,0.0,0.491592
141,Wallingford,1007190,GB,GBP,27.0,0.0,0.060245
142,Walsall,1007192,GB,GBP,832.0,0.0,2.177804
183,Broadstairs,1006569,GB,GBP,137.0,0.0,0.345322
184,Broadway,1006570,GB,GBP,8.0,0.0,0.024582
253,Kirkwall,1007361,GB,GBP,46.0,0.0,0.111931
278,Rawtenstall,1007007,GB,GBP,6.0,0.0,0.016169
311,Tattenhall,1007148,GB,GBP,28.0,0.0,0.079470
321,Wallington,1007191,GB,GBP,33.0,0.0,0.088308
328,Willenhall,1007231,GB,GBP,141.0,0.0,0.362815
356,Birstall,1006525,GB,GBP,314.0,1.0,0.810502
478,Shepton Mallet,1007068,GB,GBP,109.0,0.0,0.285291
510,West Malling,1007214,GB,GBP,34.0,0.0,0.087178
546,Callington,1006594,GB,GBP,16.0,0.0,0.040879
561,Dingwall,1007316,GB,GBP,50.0,0.0,0.135643
595,Hucknall,1006814,GB,GBP,236.0,0.0,0.604410
607,Larkhall,1007363,GB,GBP,26.0,1.0,0.074705
628,Northallerton,1006958,GB,GBP,98.0,0.0,0.263757
788,Mildenhall,1006930,GB,GBP,66.0,0.0,0.167967
831,Swallowfield,1007140,GB,GBP,2.0,0.0,0.005092

In [56]:
#retriving characters within cells is similar to the slicing concenpt employed
#so to return the even rows between 10th rows and 20th
data[10:20:2]

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency)
10,Bishop s Stortford,1006528,GB,GBP,124.0,0.0,0.319464
12,Blackpool,1006532,GB,GBP,753.0,2.0,1.922611
14,Bloxham,1006535,GB,GBP,16.0,0.0,0.030731
16,Bognor Regis,1006538,GB,GBP,75.0,0.0,0.186539
18,Bradford-on-Avon,1006554,GB,GBP,9.0,0.0,0.026149

In [ ]:
#an important concept to note is that by adding str in the end of the series ie. data.City.str
#this essentially referring to the data in the cell

In [65]:
#here we returns the first 5 characters of the City column
#and make this 5 characters of its own column
data["City5"] = data.City.str[:5]
data.head()

,City,City ID,Country,Advertiser Currency,Impressions,Clicks,Revenue (Adv Currency),City5
0,Abingdon,1006457,GB,GBP,174.0,1.0,0.468812,Abing
1,Alloa,1007295,GB,GBP,89.0,0.0,0.252819,Alloa
2,Amersham,1006474,GB,GBP,45.0,0.0,0.126163,Amers
3,Annan,1007297,GB,GBP,58.0,0.0,0.144051,Annan
4,Baldock,1006493,GB,GBP,93.0,0.0,0.264777,Baldo

In [122]:
#to return the last 2 character
data.Country.str[:2].head()

0    GB
1    GB
2    GB
3    GB
4    GB
Name: Country, dtype: object

In [101]:
#concatenate two strings from 2 different cells using .str.cat
#syntax is str.cat(others=[list], sep="additional string")
#others default is None 
data.City.str.cat(others=data.Country, sep="--").head()

0    Abingdon--GB
1       Alloa--GB
2    Amersham--GB
3       Annan--GB
4     Baldock--GB
Name: City, dtype: object

In [100]:
#to concatenate multiple string it's nested method as below
data["City ID"].str.cat(data.City.str.cat(others=data.Country, sep="--"), sep="--").head()

0    1006457--Abingdon--GB
1       1007295--Alloa--GB
2    1006474--Amersham--GB
3       1007297--Annan--GB
4     1006493--Baldock--GB
Name: City ID, dtype: object